Revit 2027 API
IndexBuffer.GetIndexStreamLine Method
 Gets a stream that can be used to write IndexLine segment primitives into the buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IndexStreamLine GetIndexStreamLine()
Public Function GetIndexStreamLine As IndexStreamLine
public:
IndexStreamLine^ GetIndexStreamLine()
member GetIndexStreamLine : unit -> IndexStreamLine
Return Value
IndexStreamLine
 The stream that can be used to write into this buffer.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space.
See Also
Reference
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace